fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаДоговор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Создать(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Период) Тогда 
		Сообщить("Не заполнен период"); 
		Возврат; 
	КонецЕсли;   
	
	ДоговорыКонтрагентов =  ПолучитьДоговорыКонтрагентов();
	ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов);
	
	ПараметрыВыполнения = Новый Структура;
	ЛогЗагрузки = ""; 
	
	ПараметрыЗапуска = Новый Структура("ПараметрыВыполнения", ПараметрыВыполнения);    
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
		
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал  = 2;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект, ЛогЗагрузки), ПараметрыОжидания);
	

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаписатьДоговорыВТабличнуюЧасть(ДоговорыКонтрагентов)
	
	 Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
        Для Каждого Договор Из ДоговорыКонтрагентов Цикл
            НоваяСтрока = Объект.Список.Добавить(); 
            НоваяСтрока.Договор = Договор; 
        КонецЦикла; 
    КонецЕсли;

	
КонецПроцедуры 

 Функция ПолучитьДоговорыКонтрагентов()
    	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияТоваровУслуг.Договор.Ссылка <> ДоговорыКонтрагентов.Владелец.Ссылка
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Ссылка <> РеализацияТоваровУслуг.Договор.Ссылка
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И ДоговорыКонтрагентов.Владелец.Ссылка = РеализацияТоваровУслуг.Контрагент.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	МассивДоговоров = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла;  
	
	Возврат МассивДоговоров;  
КонецФункции

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере (ПараметрыЗапуска, УникальныйИдентификатор) экспорт
        
    НаименованиеЗадания = "Запуск длительной операции";
	
	ВыполняемыйМетод = "ВКМ_ГрупповоеСозданиеРеализаций1.СозданиеРеализаций";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина; 
	
	МассивДанных = Новый Массив; 
	СтруктураРеквизитов = Новый Структура("Период", Объект.ВКМ_Период); 
	МассивДанных.Добавить(СтруктураРеквизитов);
	ТаблицаЗначений = Объект.Список.Выгрузить();  
	ТЗРеквизитов = Новый ТаблицаЗначений; 
	ТЗРеквизитов.Колонки.Добавить("Организация");
	ТЗРеквизитов.Колонки.Добавить("Контрагент");
	ТЗРеквизитов.Колонки.Добавить("Договор");
		
	Для Каждого СтрТаблицыЗначений из ТаблицаЗначений Цикл
		ДоговорСсылка = СтрТаблицыЗначений.Договор;
		ОбъектДоговор = ДоговорСсылка.ПолучитьОбъект();  
		
		НоваяСтрока = ТЗРеквизитов.Добавить(); 
		НоваяСтрока.Организация = ОбъектДоговор.Организация;
		НоваяСтрока.Контрагент = ОбъектДоговор.Владелец;
		НоваяСтрока.Договор = ОбъектДоговор;
		
		МассивСтруктур = ТаблицаЗначенийВМассив(ТЗРеквизитов);
		МассивДанных.Добавить(МассивСтруктур); 
		ПараметрыЗапуска.Вставить("ДанныеОбъекта", МассивДанных);
	КонецЦикла;
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;

        
КонецФункции  

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт  // Заполняем таблицу Список
    
    Массив = Новый Массив();
    СтруктураСтрокой = "";
    НужнаЗапятая = Ложь;
    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        Если НужнаЗапятая Тогда
            СтруктураСтрокой = СтруктураСтрокой + ",";
        КонецЕсли;
        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
        НужнаЗапятая = Истина;
    КонецЦикла;
    Для Каждого Строка Из ТаблицаЗначений Цикл
        НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        Массив.Добавить(НоваяСтрока);
    КонецЦикла;
    Возврат Массив;

КонецФункции

&НаКлиенте
Процедура ОбработатьДанные(Результат, ЛогЗагрузки) Экспорт
  ЗаполнитьРеализацииНаСервере(); 
    А=1;    
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРеализацииНаСервере() 
	НачПериод = Объект.ВКМ_Период.ДатаНачала;
	КонПериод = Объект.ВКМ_Период.ДатаОкончания;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Дата <= &НачПериода
	|	И РеализацияТоваровУслуг.Дата >= &КонПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("КонПериода", КонПериод); 
	Запрос.УстановитьПараметр("НачПериода", НачПериод); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();  
	Таблица = РезультатЗапроса.Выгрузить();
	
	ТЗ = Новый ТаблицаЗначений; 
	ТЗ.Колонки.Добавить("Договор"); 
	ТЗ.Колонки.Добавить("Реализация"); 
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Договор = Выборка.Договор; 
		НоваяСтрока.Реализация = Выборка.Реализация;
	КонецЦикла;  
	
	Для Каждого Строка Из Объект.Список Цикл
		СтрокаТЗ = ТЗ.Найти(Строка.Договор);
		Если ЗначениеЗаполнено(СтрокаТЗ) Тогда
			Строка.Реализация = СтрокаТЗ.Реализация;
		КонецЕсли; 
	КонецЦикла; 

 КонецПроцедуры;
	
#КонецОбласти
